интмаг/src/Documents/ПоступлениеТоваров/ПоступлениеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеТоваров</name>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.Закупки</registerRecords>
  <attributes>
    <name>Пастовщик</name>
    <type>
      <types>CatalogRef.Пастовщик</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаЗакупки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

интмаг/src/AccumulationRegisters/ОстаткиТоваров/ОстаткиТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиТоваров</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

интмаг/src/Documents/ПоступлениеТоваров/ObjectModule.bsl
Процедура ПриИзмененииСтроки(Элемент)
    Если Элемент.Имя = "Товары" Тогда
        ТекущаяСтрока = Элемент.ТекущиеДанные;

        // Пересчет суммы строки
        Если ТекущаяСтрока.Количество <> Неопределено И ТекущаяСтрока.ЦенаЗакупки <> Неопределено Тогда
            ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.ЦенаЗакупки;
        Иначе
            ТекущаяСтрока.Сумма = 0;
        КонецЕсли;

        // Пересчет общей суммы
        ЭтотОбъект.Сумма = 0;
        Для Каждого Строка Из Товары Цикл
            ЭтотОбъект.Сумма = ЭтотОбъект.Сумма + Строка.Сумма;
        КонецЦикла;
    КонецЕсли;
КонецПроцедуры  

Процедура ОбработкаПроведения(Отказ)
    Движения.ОстаткиТоваров.Записывать = Истина;

    Для Каждого Строка Из Товары Цикл
        // Добавляем движение прихода остатков
        Движение = Движения.ОстаткиТоваров.Добавить();
        Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
        Движение.Период = ЭтотОбъект.Дата;
        Движение.Номенклатура = Строка.Номенклатура;
        Движение.Склад = ЭтотОбъект.Склад;
        Движение.Количество = Строка.Количество;
    КонецЦикла;
КонецПроцедуры
